#+Include: ../../doc.templates/title-injects.org
#+Include: ../../preamble.org

# C-c C-v C-b to eval all blocks

** DONE Visit

#+name: visit  
#+begin_src R :exports both :dir ../../doc.generation/mustache :results value org drawer :cache no :var iduser=usercode day=9
library(whisker)
cs <- read.csv2("../../data.out/ft_visits.csv", sep=";", header=TRUE, skip=0, na.strings=c("","nil"), stringsAsFactors=FALSE)
cs <- cs[order(cs$IdPerson, cs$LastName), ]

cs <- cs[cs$IdUser==iduser,]
cs <- cs[cs$Day==day,]

cs <- cs[cs$PossibleQ,]

visit <- unname(rowSplit(cs))

f <- "visit.org"
template <- readChar(f, file.info(f)$size)
f <- "visitbase.org"
visitbase <- readChar(f, file.info(f)$size)
f <- "symptoms.org"
symptoms <- readChar(f, file.info(f)$size)

text <- whisker.render(template, partials=list(visitbase=visitbase, symptoms=symptoms))
text <- gsub("[\r]", "", text)
text
#+end_src

#+RESULTS: visit
:RESULTS:

   /Visit[fn:: Person -- 47]/\nopagebreak
 
   
   #+Attr_Latex: :center nil :booktabs t
   |---------------------------+-------------------------------------------------------------|
   | Name                      | Chiapali Iyorhe                                  |
   | Sex \ldots DoB \ldots Age | female \ldots 13 \ldots 2001-11-06               |
   | Number of Visit           | 1    |
   | Scheduled Time            | 2015-06-09 19:15                                      |
   | Priority                  | 3                                               |
   |---------------------------+-------------------------------------------------------------|
       
   #+Attr_Latex: :center nil :booktabs t
   |-------------+-----------------|
   | Available   | yes   |
   | Cooperative | yes |
   |-------------+-----------------|
      
   
   #+Attr_Latex: :center nil :booktabs t
   |--------------------------+-----------------------------------------+
   | Onset of Symptoms        | NA   
   | Date of Death            | NA                         |
   |--------------------------+-----------------------------------------+
   | Fever \ldots Temp.       | no \ldots NA        |
   | Lethargy                 | no                            |
   | Muscle Pain              | no                          |
   | Headache                 | no                            |
   |--------------------------+-----------------------------------------+
   | Stomach Pain             | no                         |
   | Diarrhea                 | no                            |
   | Vomiting                 | no                            |
   | Breathing Difficulties   | no                       |
   | Difficulty Swallowing    | no                      |
   | Hiccup                   | no                             |
   |--------------------------+-----------------------------------------+
   | Unexplained Bleeding     | no                       |
   |--------------------------+-----------------------------------------+
   | Anorexia                 | no                            |
   | Maculo-papular Rash      | no                              |
   | Unexplained Sudden Death | no                    |
   |--------------------------+-----------------------------------------+
 
   
   #+Attr_Latex: :center nil :booktabs t
   |----------------------+---------------------------------------------------------|
   | Psychosocial Support | no                                        |
   | Next Appointment     | 2015-06-10 12:15                                         |
   |----------------------+---------------------------------------------------------|
   | Remarks              | /Please feel free to invent further details/            |
   |                      | /that are consistent with the information given above./ |
   |----------------------+---------------------------------------------------------|

   #+Latex: \medskip  
   /Visit[fn:: Person -- 121]/\nopagebreak
 
   
   #+Attr_Latex: :center nil :booktabs t
   |---------------------------+-------------------------------------------------------------|
   | Name                      | Ayodele Oparathompson                                  |
   | Sex \ldots DoB \ldots Age | male \ldots 17 \ldots 1997-01-06               |
   | Number of Visit           | 1    |
   | Scheduled Time            | 2015-06-09 08:15                                      |
   | Priority                  | 2                                               |
   |---------------------------+-------------------------------------------------------------|
       
   #+Attr_Latex: :center nil :booktabs t
   |-------------+-----------------|
   | Available   | yes   |
   | Cooperative | yes |
   |-------------+-----------------|
      
   
   #+Attr_Latex: :center nil :booktabs t
   |--------------------------+-----------------------------------------+
   | Onset of Symptoms        | NA   
   | Date of Death            | NA                         |
   |--------------------------+-----------------------------------------+
   | Fever \ldots Temp.       | no \ldots NA        |
   | Lethargy                 | no                            |
   | Muscle Pain              | no                          |
   | Headache                 | no                            |
   |--------------------------+-----------------------------------------+
   | Stomach Pain             | no                         |
   | Diarrhea                 | no                            |
   | Vomiting                 | no                            |
   | Breathing Difficulties   | no                       |
   | Difficulty Swallowing    | no                      |
   | Hiccup                   | no                             |
   |--------------------------+-----------------------------------------+
   | Unexplained Bleeding     | no                       |
   |--------------------------+-----------------------------------------+
   | Anorexia                 | no                            |
   | Maculo-papular Rash      | no                              |
   | Unexplained Sudden Death | no                    |
   |--------------------------+-----------------------------------------+
 
   
   #+Attr_Latex: :center nil :booktabs t
   |----------------------+---------------------------------------------------------|
   | Psychosocial Support | yes                                        |
   | Next Appointment     | 2015-06-10 14:45                                         |
   |----------------------+---------------------------------------------------------|
   | Remarks              | /Please feel free to invent further details/            |
   |                      | /that are consistent with the information given above./ |
   |----------------------+---------------------------------------------------------|

   #+Latex: \medskip  
   /Visit[fn:: Person -- 149]/\nopagebreak
 
   
   #+Attr_Latex: :center nil :booktabs t
   |---------------------------+-------------------------------------------------------------|
   | Name                      | Olafimihan Awosola                                  |
   | Sex \ldots DoB \ldots Age | male \ldots 43 \ldots 1971-03-08               |
   | Number of Visit           | 1    |
   | Scheduled Time            | 2015-06-09 13:00                                      |
   | Priority                  | 2                                               |
   |---------------------------+-------------------------------------------------------------|
       
   #+Attr_Latex: :center nil :booktabs t
   |-------------+-----------------|
   | Available   | yes   |
   | Cooperative | yes |
   |-------------+-----------------|
      
   
   #+Attr_Latex: :center nil :booktabs t
   |--------------------------+-----------------------------------------+
   | Onset of Symptoms        | NA   
   | Date of Death            | NA                         |
   |--------------------------+-----------------------------------------+
   | Fever \ldots Temp.       | no \ldots NA        |
   | Lethargy                 | no                            |
   | Muscle Pain              | no                          |
   | Headache                 | no                            |
   |--------------------------+-----------------------------------------+
   | Stomach Pain             | no                         |
   | Diarrhea                 | no                            |
   | Vomiting                 | no                            |
   | Breathing Difficulties   | no                       |
   | Difficulty Swallowing    | no                      |
   | Hiccup                   | no                             |
   |--------------------------+-----------------------------------------+
   | Unexplained Bleeding     | no                       |
   |--------------------------+-----------------------------------------+
   | Anorexia                 | no                            |
   | Maculo-papular Rash      | no                              |
   | Unexplained Sudden Death | no                    |
   |--------------------------+-----------------------------------------+
 
   
   #+Attr_Latex: :center nil :booktabs t
   |----------------------+---------------------------------------------------------|
   | Psychosocial Support | yes                                        |
   | Next Appointment     | 2015-06-10 14:00                                         |
   |----------------------+---------------------------------------------------------|
   | Remarks              | /Please feel free to invent further details/            |
   |                      | /that are consistent with the information given above./ |
   |----------------------+---------------------------------------------------------|

   #+Latex: \medskip  
   /Visit[fn:: Person -- 204]/\nopagebreak
 
   
   #+Attr_Latex: :center nil :booktabs t
   |---------------------------+-------------------------------------------------------------|
   | Name                      | Akinola Dilomprizulike                                  |
   | Sex \ldots DoB \ldots Age | male \ldots 27 \ldots 1987-11-08               |
   | Number of Visit           | 1    |
   | Scheduled Time            | 2015-06-09 18:15                                      |
   | Priority                  | 1                                               |
   |---------------------------+-------------------------------------------------------------|
       
   #+Attr_Latex: :center nil :booktabs t
   |-------------+-----------------|
   | Available   | yes   |
   | Cooperative | yes |
   |-------------+-----------------|
      
   
   #+Attr_Latex: :center nil :booktabs t
   |--------------------------+-----------------------------------------+
   | Onset of Symptoms        | NA   
   | Date of Death            | NA                         |
   |--------------------------+-----------------------------------------+
   | Fever \ldots Temp.       | no \ldots NA        |
   | Lethargy                 | no                            |
   | Muscle Pain              | no                          |
   | Headache                 | no                            |
   |--------------------------+-----------------------------------------+
   | Stomach Pain             | no                         |
   | Diarrhea                 | no                            |
   | Vomiting                 | no                            |
   | Breathing Difficulties   | no                       |
   | Difficulty Swallowing    | no                      |
   | Hiccup                   | no                             |
   |--------------------------+-----------------------------------------+
   | Unexplained Bleeding     | no                       |
   |--------------------------+-----------------------------------------+
   | Anorexia                 | no                            |
   | Maculo-papular Rash      | no                              |
   | Unexplained Sudden Death | no                    |
   |--------------------------+-----------------------------------------+
 
   
   #+Attr_Latex: :center nil :booktabs t
   |----------------------+---------------------------------------------------------|
   | Psychosocial Support | NA                                        |
   | Next Appointment     | 2015-06-10 08:15                                         |
   |----------------------+---------------------------------------------------------|
   | Remarks              | /Please feel free to invent further details/            |
   |                      | /that are consistent with the information given above./ |
   |----------------------+---------------------------------------------------------|

   #+Latex: \medskip  
   /Visit[fn:: Person -- 205]/\nopagebreak
 
   
   #+Attr_Latex: :center nil :booktabs t
   |---------------------------+-------------------------------------------------------------|
   | Name                      | Obiora Obasanjo                                  |
   | Sex \ldots DoB \ldots Age | male \ldots 61 \ldots 1954-10-04               |
   | Number of Visit           | 1    |
   | Scheduled Time            | 2015-06-09 15:15                                      |
   | Priority                  | 2                                               |
   |---------------------------+-------------------------------------------------------------|
       
   #+Attr_Latex: :center nil :booktabs t
   |-------------+-----------------|
   | Available   | yes   |
   | Cooperative | yes |
   |-------------+-----------------|
      
   
   #+Attr_Latex: :center nil :booktabs t
   |--------------------------+-----------------------------------------+
   | Onset of Symptoms        | NA   
   | Date of Death            | NA                         |
   |--------------------------+-----------------------------------------+
   | Fever \ldots Temp.       | no \ldots NA        |
   | Lethargy                 | no                            |
   | Muscle Pain              | no                          |
   | Headache                 | no                            |
   |--------------------------+-----------------------------------------+
   | Stomach Pain             | no                         |
   | Diarrhea                 | no                            |
   | Vomiting                 | no                            |
   | Breathing Difficulties   | no                       |
   | Difficulty Swallowing    | no                      |
   | Hiccup                   | no                             |
   |--------------------------+-----------------------------------------+
   | Unexplained Bleeding     | no                       |
   |--------------------------+-----------------------------------------+
   | Anorexia                 | no                            |
   | Maculo-papular Rash      | no                              |
   | Unexplained Sudden Death | no                    |
   |--------------------------+-----------------------------------------+
 
   
   #+Attr_Latex: :center nil :booktabs t
   |----------------------+---------------------------------------------------------|
   | Psychosocial Support | NA                                        |
   | Next Appointment     | 2015-06-10 12:45                                         |
   |----------------------+---------------------------------------------------------|
   | Remarks              | /Please feel free to invent further details/            |
   |                      | /that are consistent with the information given above./ |
   |----------------------+---------------------------------------------------------|

   #+Latex: \medskip  


:END:

** DONE Visit not possible 

#+name: visitno  
#+begin_src R :exports both :dir ../../doc.generation/mustache :results value org drawer :cache no :var iduser=usercode day=12
library(whisker)
cs <- read.csv2("../../data.out/ft_visits.csv", sep=";", header=TRUE, skip=0, na.strings=c("","nil"), stringsAsFactors=FALSE)
cs <- cs[order(cs$IdPerson, cs$LastName), ]

cs <- cs[cs$IdUser==iduser,]
cs <- cs[cs$Day==day,]

cs <- cs[!cs$PossibleQ,]

visit <- unname(rowSplit(cs))

f <- "visit-no.org"
template <- readChar(f, file.info(f)$size)
f <- "visitbase.org"
visitbase <- readChar(f, file.info(f)$size)

text <- whisker.render(template, partials=list(visitbase=visitbase))
text <- gsub("[\r]", "", text)
text
#+end_src

#+RESULTS: visitno
:RESULTS:

   /Visit[fn:: Person -- 149]/
 
   
   #+Attr_Latex: :center nil :booktabs t
   |---------------------------+-------------------------------------------------------------|
   | Name                      | Olafimihan Awosola                                  |
   | Sex \ldots DoB \ldots Age | male \ldots 43 \ldots 1971-03-08               |
   | Number of Visit           | 4    |
   | Scheduled Time            | 2015-06-12 19:30                                      |
   | Priority                  | 2                                               |
   |---------------------------+-------------------------------------------------------------|
     
   #+Latex: \medskip  

   /Visit[fn:: Person -- 286]/
 
   
   #+Attr_Latex: :center nil :booktabs t
   |---------------------------+-------------------------------------------------------------|
   | Name                      | Olufunso Adesina Erinle Emedolu                                  |
   | Sex \ldots DoB \ldots Age | male \ldots 12 \ldots 2003-03-31               |
   | Number of Visit           | 2    |
   | Scheduled Time            | 2015-06-12 08:30                                      |
   | Priority                  | 1                                               |
   |---------------------------+-------------------------------------------------------------|
     
   #+Latex: \medskip  



:END:

** DONE Contact

#+name: contact  
#+begin_src R :exports both :dir ../../doc.generation/mustache :results value org drawer :cache no :var iduser=usercode day=12
library(whisker)
cs <- read.csv2("../../data.out/ft_contacts_visit.csv", sep=";", header=TRUE, skip=0, 
  na.strings=c("","nil"), stringsAsFactors=FALSE)
cs <- cs[order(cs$IdCase, cs$IdPerson), ]

cs <- cs[cs$IdUser==iduser,]
cs <- cs[cs$Day==day,]

contact <- unname(rowSplit(cs))

f <- "contact.org"
contents <- readChar(f, file.info(f)$size)
f <- "person.org"
person <- readChar(f, file.info(f)$size)

text <- whisker.render(contents, partials=list(person=person))
text <- gsub("[\r]", "", text)
text
#+end_src

#+RESULTS: contact
:RESULTS:

   /Contact [fn:: \\ Case -- 281\\ Contact person -- 342]/

   #+Attr_Latex: :center nil :booktabs t
   |---------------------------+-----------------------------------------------------------|
   | Name                      | Adaeze Envoh                        |
   | Sex \ldots DoB \ldots Age | female \ldots 25 \ldots 1990-05-26 |
   |---------------------------+-----------------------------------------------------------|
   
      #+Attr_Latex: :center nil :booktabs t
   |---------------------------+-------------------------------------------------------------------------------------------+----------|
   | Name                      | Omoregie Osanebi                                                                |          |
   | Sex \ldots Age \ldots DoB | male \ldots 23 \ldots 1992-04-20                                     |
   | Marital State             | single (not living common law)                                                                          |          |
   | Home Address              | Wokemba Street \ldots Tudun Fulani \ldots Dawakin Tofa \ldots Kano                            |          |
   | Phone-1                   | 0802-7384042 mobile                                                                 |          |
   | Phone-2                   | NA NA                                                                 |          |
   | Occupation                | nurse                                                                            |          |
   |---------------------------+-------------------------------------------------------------------------------------------+----------|

   #+Attr_Latex: :center nil :booktabs t
   |----------------------+--------------------------------------------------|
   | Date of Last Contact | 2015-06-08                                    |
   | Type of Contact      | touched or shared the linens, clothes, or dishes of the case                           |
   | Type of Place        | Hospital                       |
   | Address              | Anemagu Lane \ldots Sakwaya         |
   | LGA \ldots State     | Albasu \ldots Kano               |
   | Description of Place | /Please describe the place with your own words./ |
   | Description          | /After having viewed all information/            |
   |                      | /please invent further details and/              |
   |                      | /describe the rumor with your own words./        |
   |----------------------+--------------------------------------------------|
 
   \medskip


:END:

** DONE Number of Visit Tasks
#+name: tasknumber
#+begin_src R :exports both :dir ../../doc.generation/mustache :results value org drawer :chache no :var iduser=usercode day=10
library(whisker)
cs <- read.csv2("../../data.out/ft_visits.csv", sep=";", header=TRUE, skip=0, 
  na.strings=c("","nil"), stringsAsFactors=FALSE)
cs <- cs[order(cs$IdPerson, cs$LastName), ]

cs <- cs[cs$IdUser==iduser,]
cs <- cs[cs$Day==day,]

count <- nrow(cs)

countQ <- as.logical(count>0)
countManyQ <- as.logical(count>1)
out <- data.frame(count,countQ,countManyQ)
names(out) <- c("TaskNumber","TaskQ","TasksManyQ")

task <- unname(rowSplit(out))

f <- "task-visit.org"
contents <- readChar(f, file.info(f)$size)

text <- whisker.render(contents)
text <- gsub("[\r]", "", text)
text
#+end_src

#+RESULTS: tasknumber
:RESULTS:

 /There should be at least 7 vist tasks./ 

:END:

** DONE Cases of Death

#+name: pdeath  
#+begin_src R :exports both :dir ../../doc.generation/mustache :results value org drawer :cache no :var iduser=usercode day=40
library(whisker)
cs <- read.csv2("../../data.out/ft_cases.csv", sep=";", header=TRUE, skip=0, 
  na.strings=c("","nil"), stringsAsFactors=FALSE)
cs <- cs[order(cs$IdPerson, cs$LastName), ]

cs <- cs[cs$IdUser==iduser,]
cs <- cs[cs$DateOfDeathDay==day,]
cs <- cs[!is.na(cs$DateOfDeathDay),]

case <- unname(rowSplit(cs))

f <- "case-death.org"
template <- readChar(f, file.info(f)$size)

text <- whisker.render(template)
text <- gsub("[\r]", "", text)
text
#+end_src

#+RESULTS: pdeath
:RESULTS:

   /Case of death[fn:: Person -- 121]/

   #+Attr_Latex: :center nil :booktabs t
   |---------------------------+-----------------------------------------------|
   | Name                      | Ayodele Oparathompson                    |
   | Sex \ldots DoB \ldots Age | male \ldots 17 \ldots NA |
   | Date of Death             | 2015-07-10                          |
   |---------------------------+-----------------------------------------------|
   
   \medskip
   /Case of death[fn:: Person -- 149]/

   #+Attr_Latex: :center nil :booktabs t
   |---------------------------+-----------------------------------------------|
   | Name                      | Olafimihan Awosola                    |
   | Sex \ldots DoB \ldots Age | male \ldots 43 \ldots 1971-03-08 |
   | Date of Death             | 2015-07-10                          |
   |---------------------------+-----------------------------------------------|
   
   \medskip


:END:

